{
  "minions": [
    {
      "name": "Bob",
      "description": "Bob is one of the three main characters in the films, particularly in the Minions prequel. Meanwhile, in Despicable Me 2’s final credit, he was the one who causes chaos. However, it doesn’t mean that the chaos he made is just bad. He even got some fortunes including being chosen as an employee of Scarlet Overkill. The Minion even becomes the youngest king.",
      "avatar": "https:\/\/firebasestorage.googleapis.com\/v0\/b\/tomatoo-a85d6.appspot.com\/o\/Minions%2Fminion_bob.webp?alt=media&token=6a534818-ca41-4b67-b1f3-ae92418d743b"
    },
    {
      "name": "Carl",
      "description": "Carl is taller with only one eye. He is more cheerful and easy to get along whether with his fellow Minions or with the human. However, he also likes to make a noise. He was the living alarm when his boss, Gru, burned down the phone in the second film. Carl even wore red sirens on his head as well as his hand carried a toa.",
      "avatar": "https:\/\/firebasestorage.googleapis.com\/v0\/b\/tomatoo-a85d6.appspot.com\/o\/Minions%2Fminion_carl.webp?alt=media&token=e3429422-1c82-491a-81a1-5f1902edd947"
    },
    {
      "name": "Dave",
      "description": "Dave is one of the most stand-out Minions mainly in Despicable Me 2. Sure, he is the most often to accompany Gru his mission in the world. He is a medium-sized Minion with two eyes and half-split hair on his head. Yes, he has hair and it is even quite long. He is really kind, charming, and care of others. At the same time, Dave is also really careless and, of course, he causes chaos.",
      "avatar": "https:\/\/firebasestorage.googleapis.com\/v0\/b\/tomatoo-a85d6.appspot.com\/o\/Minions%2Fminion_dave.webp?alt=media&token=0616fdf3-2c58-4949-99bf-81fe9fc9d365"
    },
    {
      "name": "Jorge",
      "description": "Jorge also appears with a very minor role. His appearance is small with two eyes. Similar to some other Minions, his hair is half-split and he looks really charming, kind, and innocent. In the movie, he wore a fireman suit when Carl and Josh make a fire on Gru phone sets.",
      "avatar": "https:\/\/firebasestorage.googleapis.com\/v0\/b\/tomatoo-a85d6.appspot.com\/o\/Minions%2Fminion_jorge.webp?alt=media&token=4b379c28-52b1-4f6c-b113-da2f15a28f50"
    },
    {
      "name": "Kevin",
      "description": "Kevin is the tallest Minion. He is also one of the three main Minions in the newest movie, Minions. Sure, for his physical appearance, Kevin becomes the most stand-out. Other characteristics that differ Kevin from others are his little standing wavy hair right in the middle of his head. In some scenes, Kevin is seen wearing a cap and golf suits.",
      "avatar": "https:\/\/firebasestorage.googleapis.com\/v0\/b\/tomatoo-a85d6.appspot.com\/o\/Minions%2Fminion_kevin.webp?alt=media&token=742332f7-98fa-4b60-88d4-24f87de05c9b"
    },
    {
      "name": "Phil",
      "description": "Phil wore baby clothes in the first movie. He is also one of three Minions who looked for a unicorn toy for Agnes. He has two eyes, neat hair, and sometimes, he looks sticking out his tongue. Phil is the Minion that often “does” cosplay. Yes, he wears many other costumes just like the baby’s above. Some costumes are the prisoner’s suit, the tropical swimsuit, and even a dress of a French maid. His personality is very interesting also; he is caring and charming.",
      "avatar": "https:\/\/firebasestorage.googleapis.com\/v0\/b\/tomatoo-a85d6.appspot.com\/o\/Minions%2Fminion_phil.webp?alt=media&token=10ab9180-098d-475a-87c7-905743e318c8"
    },
    {
      "name": "Stuart",
      "description": "Stuart is one of the main characters in Minions film. He has an eye with neat half-split hair to the right and left. Well, the hair is quite rare anyway. His personalities are funny and playful. He is also a sincere Minion with music talents like playing a guitar and ukulele. He loves banana so much. Stuart hates being disturbed by others. However, in the movie, it was often seen that he was with Dave.",
      "avatar": "https:\/\/firebasestorage.googleapis.com\/v0\/b\/tomatoo-a85d6.appspot.com\/o\/Minions%2Fminion_stuart.webp?alt=media&token=8b7fe4a1-5449-4ef1-b2df-fb1ef8e21545"
    },
    {
      "name": "Tim",
      "description": "Just like Kevin, Tim is taller and slimmer than other Minions. His hair is tall also and sharp just like the shoot of the tree. He was one of the Minions who look for a Unicorn toy for Agnes. In term of personalities, Tim is quite serious and temperamental. Sometimes, he looks selfish and doesn’t want to be lost as well as laughed. In the movie, Tim looked like an older Minion with his long beard.",
      "avatar": "https:\/\/firebasestorage.googleapis.com\/v0\/b\/tomatoo-a85d6.appspot.com\/o\/Minions%2Fminion_tim.jpeg?alt=media&token=88ee4c45-668b-4bc9-b25d-2b1a43b5a3ba"
    },
    {
      "name": "Darwin",
      "description": "Darwin’s body is not as tall as Carl but also not as short as Bob. With this medium-sized body, he looks faster and more dexterous compared with others. He is one of the one-eyed Minions in the movie series. He is known for his plan to steal Larry’s banana. Darwin is indeed quite egoistic. Sometimes, his actions cause troubles for Gru and his fellow Minions. Uniquely, he is polite and well-behaved with other people.",
      "avatar": "https:\/\/firebasestorage.googleapis.com\/v0\/b\/tomatoo-a85d6.appspot.com\/o\/Minions%2Fminion_darwin.webp?alt=media&token=16342e15-32ad-4016-b77a-79351a363e95"
    },
    {
      "name": "Jerry",
      "description": "Jerry appears in two series of Despicable Me; Despicable Me and Despicable Me 2. However, the Minion seems to be absent in the prequel, Minions. He is a short and fat Minion with two eyes. His hair is short and sharp. In the films, Jerry is known as the role to monitor Gru’s daughters. Meanwhile, he also had a habit to scream “Whaaaaaaatt?!”. Jerry is cheerful and jolly. But just like many other Minions, he is reckless and coward also.",
      "avatar": "https:\/\/firebasestorage.googleapis.com\/v0\/b\/tomatoo-a85d6.appspot.com\/o\/Minions%2Fminion_jerry.webp?alt=media&token=0a315c91-6690-447a-81dd-94a38b772ec5"
    },
    {
      "name": "John",
      "description": "John appears briefly in the first and second movies of Despicable Me. But he took different roles in both movies. John is the one-eyed Minion who was being the referee at the end of the first movie. Then, he was also the Minion who acted like a foreman while other Minions make jellies. John was also the one who tasted the jelly.",
      "avatar": "https:\/\/firebasestorage.googleapis.com\/v0\/b\/tomatoo-a85d6.appspot.com\/o\/Minions%2Fminion_john.jpeg?alt=media&token=e3ea2b4e-e788-4784-bdd2-87458e8f4878"
    },
    {
      "name": "Ken",
      "description": "Ken’s appearance is very similar to Kevin. Kevin is known as the tallest Minion indeed. But he sometimes looks taller, maybe because of his body that is quite thin. Ken is seen with one of his fellow Minions, Mike in the short movie, Panic in the Mailroom. In the movie, Mike turned into a purple or evil Minion. Although Ken is not the main character of the movie, his characteristic can be easily recognized. He can be easily disturbed. Meanwhile, he also loves video games and animals",
      "avatar": "https:\/\/firebasestorage.googleapis.com\/v0\/b\/tomatoo-a85d6.appspot.com\/o\/Minions%2Fminion_ken.jpeg?alt=media&token=493ecfad-1a25-42f4-b9b6-a016b0a3fb94"
    },
    {
      "name": "Lance",
      "description": "Lance is a one-eyed Minion with some sheets of hair on his head. The hair has a buzz-cut style anyway. Lance is seen in the second film when he helped Gru to gather information about El Macho. He was also the one who cleaned the door’s knob after Tom has been kidnapped.",
      "avatar": "https:\/\/firebasestorage.googleapis.com\/v0\/b\/tomatoo-a85d6.appspot.com\/o\/Minions%2Fminion_lance.webp?alt=media&token=95afefc8-200f-4699-b79e-cdb472c0bf57"
    },
    {
      "name": "Larry",
      "description": "Larry is not the main character and he also doesn’t have any important role. However, he appears in all series of Despicable Me although his appearance is very short. At the end of the first movie, he danced in front of the musical instruments. Besides, he was the first Minion who tasted the jam or jelly in the second film.",
      "avatar": "https:\/\/firebasestorage.googleapis.com\/v0\/b\/tomatoo-a85d6.appspot.com\/o\/Minions%2Fminion_larry.jpeg?alt=media&token=8fda1798-6ef3-4fd6-b55d-72b9874fe70b"
    },
    {
      "name": "Mark",
      "description": "In term of physical appearance, Mark looks very similar to Dave. He has two eyes and a medium-sized body. His hair is combed neatly with a half-split style. Mark was one of the Minions that were sent on a mission to look for a unicorn doll for Agnes, one of Gru’s kids. In the second film, he was one of the Minions that were arrested in the ice cream truck. Mark has a very interesting personality. He loves singing and dancing but sometimes, he looks like a nerdy Minion.",
      "avatar": "https:\/\/firebasestorage.googleapis.com\/v0\/b\/tomatoo-a85d6.appspot.com\/o\/Minions%2Fminion_mark.webp?alt=media&token=59e3ad39-7996-4d12-80da-13e697141375"
    },
    {
      "name": "Mike",
      "description": "Mike is one of the main Minion characters in the short video, Panic in the Mailroom. It has been mentioned before; the video is featured in the DVD version of Despicable Me 2. Sure, you can also watch it on YouTube and DailyMotion.",
      "avatar": "https:\/\/firebasestorage.googleapis.com\/v0\/b\/tomatoo-a85d6.appspot.com\/o\/Minions%2Fminion_mike.jpeg?alt=media&token=a345ca21-5714-49a9-bbfd-1fe30074f7f6"
    },
    {
      "name": "Tom",
      "description": "Tom is often seen to wear a maid dress. Sure, it is just in line with his personalities and behaviors that loves cleanliness and caring. Besides, Tom also loves singing and dancing. In Despicable Me 2, Tom was the first Minion that is infected by PX-41 Serum. Besides, he was the last Minion that was changed back into a yellow Minion.",
      "avatar": "https:\/\/firebasestorage.googleapis.com\/v0\/b\/tomatoo-a85d6.appspot.com\/o\/Minions%2Fminion_tom.webp?alt=media&token=5299ca8c-3975-4b98-bee0-cfe90930a721"
    },
    {
      "name": "Donny",
      "description": "Donny is probably one of the funniest Minions although his appearance is quite short. He looks stupid and innocent as well as has some favorite activities; singing and dancing. One of the most memorable scenes with Donny is when John and Paul asked him to carry fruits. To get the fruits, Donny jumped in the fruit container. Besides, he was also known as a Minion whose the head got stuck in the jar.",
      "avatar": "https:\/\/firebasestorage.googleapis.com\/v0\/b\/tomatoo-a85d6.appspot.com\/o\/Minions%2Fminion_donny.webp?alt=media&token=3889b750-3c54-4b7c-8bd7-c1e8a268ddbd"
    }
  ]
}